Reading SQL via Pandas

In [4]:
import pandas as pd
import sqlite3

Accessing DB via traditional connection method

In [10]:
conn = sqlite3.connect('data/sakila.db')

In [11]:
cur = conn.cursor()

In [12]:
cur.execute("SELECT * FROM actor LIMIT 5;")

In [13]:
results = cur.fetchall()

In [14]:
results

[(1, 'PENELOPE', 'GUINESS', '2019-04-11 18:11:48'),
 (2, 'NICK', 'WAHLBERG', '2019-04-11 18:11:48'),
 (3, 'ED', 'CHASE', '2019-04-11 18:11:48'),
 (4, 'JENNIFER', 'DAVIS', '2019-04-11 18:11:48'),
 (5, 'JOHNNY', 'LOLLOBRIGIDA', '2019-04-11 18:11:48')]

In [15]:
df = pd.DataFrame(results)

In [16]:
df

   0         1             2                    3
0  1  PENELOPE       GUINESS  2019-04-11 18:11:48
1  2      NICK      WAHLBERG  2019-04-11 18:11:48
2  3        ED         CHASE  2019-04-11 18:11:48
3  4  JENNIFER         DAVIS  2019-04-11 18:11:48
4  5    JOHNNY  LOLLOBRIGIDA  2019-04-11 18:11:48

Using pandas read_sql method

In [17]:
conn = sqlite3.connect('data/sakila.db')

In [24]:
df = pd.read_sql('SELECT * from actor limit 10', conn)

In [25]:
df

   actor_id first_name     last_name          last_update
0         1   PENELOPE       GUINESS  2019-04-11 18:11:48
1         2       NICK      WAHLBERG  2019-04-11 18:11:48
2         3         ED         CHASE  2019-04-11 18:11:48
3         4   JENNIFER         DAVIS  2019-04-11 18:11:48
4         5     JOHNNY  LOLLOBRIGIDA  2019-04-11 18:11:48
5         6      BETTE     NICHOLSON  2019-04-11 18:11:48
6         7      GRACE        MOSTEL  2019-04-11 18:11:48
7         8    MATTHEW     JOHANSSON  2019-04-11 18:11:48
8         9        JOE         SWANK  2019-04-11 18:11:48
9        10  CHRISTIAN         GABLE  2019-04-11 18:11:48

Using pandas read_sql_query method

In [27]:
df = pd.read_sql_query('Select * from actor', conn, 
                       index_col = 'actor_id',
                       parse_dates = 'last_modified')

In [35]:
# df
conn.close()

Using read_sql_table method

In [36]:
### Requires SQLAlchemy 
from sqlalchemy import create_engine

engine = create_engine('sqlite:///data/sakila.db')

connection = engine.connect()
connection.close()

# df = pd.read_sql_table('actor', con=connection)